Revit 2027 API
BuiltInFailures.GenericMEPFailures.FlowConfigMismatch Property
 [Element Name]: It is not possible to calculate the flow since all the components in this system have the flow configuration set to Preset or System. At least one component is required to have the flow configuration set to Calculated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FlowConfigMismatch { get; }
Public Shared ReadOnly Property FlowConfigMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FlowConfigMismatch {
	FailureDefinitionId^ get ();
}
static member FlowConfigMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace